Revit 2024 API
LabelUtils.GetLabelFor Method (gbXMLBuildingType, Document)
 Gets the user-visible name for a gbXMLBuildingType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static string GetLabelFor(
	gbXMLBuildingType buildingType,
	Document document
)
Visual Basic
Public Shared Function GetLabelFor ( _
	buildingType As gbXMLBuildingType, _
	document As Document _
) As String
Visual C++
public:
static String^ GetLabelFor(
	gbXMLBuildingType buildingType,
	Document^ document
)
Parameters
buildingType
Type: Autodesk.Revit.DB.Analysis.gbXMLBuildingType
 The gbXMLBuildingType to get the user-visible name.
document
Type: Autodesk.Revit.DB.Document
 The document from which to get the gbXMLBuildingType.
Remarks
 The name is obtained in the current Revit language.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input gXMLBuildingType is not available in the document.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace